{"input": "Invoice No: INV-45678\nVendor: Global Software Solutions\nBill To: Acme Corp LLC\nDate Issued: 2024-09-10\nDue Date: 2024-10-10\n\nService Description:\n1. Enterprise Licensing Fee (Q4 2024): 100 seats @ $50/seat = $5,000.00\n2. Premium Support Package (Annual): Flat Fee = $1,500.00\n\nSubtotal: $6,500.00\nTax (GST 18%): $1,170.00\nTotal Due: $7,670.00\n\nPayment Method: Bank Transfer. Please reference PO-ACME-4492 in the transaction details. Late payment interest rate is 1.5% per month.", "output": "Invoices"}
{"input": "Meeting Minutes Summary\nProject: Q4 Sales Strategy Review\nDate: 2024-09-05\nAttendees: V. Sharma, A. Lee, R. Johnson\n\nDiscussion Highlights:\n1. APAC Market Entry: Approved $50,000 budget for localized digital campaigns.\n2. Product Focus: Prioritize Product B over Product C for Q4 marketing efforts due to higher margins.\n3. Staffing: Approved two new hires for the technical pre-sales team.\n\nAction Items:\n- A. Lee: Finalize APAC vendor contracts by 09/15.\n- R. Johnson: Draft updated sales commission structure reflecting Q4 priorities.\n\nRisk Assessment: High regulatory complexity in the new market. Legal review pending.", "output": "Meeting_Minutes"}
{"input": "Assignment: Differential Equations\nCourse: MAT 301\nDue Date: 2024-10-20\n\nProblem 1: Solve the second-order non-homogeneous differential equation using the method of undetermined coefficients: y'' + 4y' + 4y = e^(-2t) * t^2.\n\nProblem 2: Use Laplace transforms to solve the initial value problem: y'' - 2y' + 5y = 0, with y(0)=2 and y'(0)=4. Show all steps for finding the inverse Laplace transform.\n\nSubmission Requirements: Submit scanned handwritten solutions clearly labeled by problem number. Late submissions will not be accepted.", "output": "Mathematics"}
{"input": "Lab Report - Experiment 5: Acid-Base Titration\nDate: 2024-10-01\n\nObjective: To determine the concentration of an unknown hydrochloric acid (HCl) solution using a standardized sodium hydroxide (NaOH) solution.\n\nProcedure Summary:\n1. Standardized NaOH (0.100 M) was prepared.\n2. 20.00 mL of unknown HCl was pipetted into the flask.\n3. Phenolphthalein indicator added.\n4. Titration performed until the endpoint (faint pink) was reached.\n\nResults:\nAverage volume of NaOH consumed: 15.50 mL.\nCalculation: M_HCl * V_HCl = M_NaOH * V_NaOH\nM_HCl = (0.100 M * 15.50 mL) / 20.00 mL = 0.0775 M.\n\nConclusion: The concentration of the unknown acid is 0.0775 M.", "output": "Chemistry"}
{"input": "Subject: Refund Confirmation for Order #98765\nFrom: Customer Service <service@shopnow.com>\nTo: J. R. Smith\nDate: 2024-09-01\n\nDear Customer,\n\nThis email confirms that your refund for Order #98765, placed on 2024-08-20, has been successfully processed.\n\nReason: Item 'Smartwatch Model Z' was returned defective.\nAmount Refunded: $299.99\nTransaction ID: REF-4492-B\n\nThe refund was issued back to your original payment method (Visa ending XXXX-5555) and typically takes 5-10 business days to appear on your statement. You will receive a separate confirmation from your bank once the funds are posted. No further action is required from your side. Thank you for shopping with us.", "output": "Client_Emails"}
{"input": "Travel Confirmation - Flight Booking\nBooking Reference: A7YF3K\nPassenger: Mr. P. K. Desai\nAirline: Air India (AI 808)\nRoute: Mumbai (BOM) to Dubai (DXB)\nDate: 2024-12-15\nDeparture: 23:00 IST\nArrival: 01:30 GST (Next Day)\nClass: Economy\nTicket Cost: INR 18,500\n\nBaggage Allowance: 25 kg checked, 7 kg cabin. Please check-in online 24 hours prior to departure. Gate information will be updated on the airport screens.", "output": "Tickets"}
{"input": "Medical Summary Report\nPatient: Arora, Priya\nDate of Birth: 1985-05-20\nMRN: 779920\n\nDiagnosis: Migraine with Aura (G43.109)\n\nHistory of Present Illness: Patient presents with a 3-day history of severe, pulsating headache localized to the left temporal region, preceded by visual disturbances. Patient reports nausea but no vomiting. Pain scale 8/10.\n\nTreatment Plan:\n1. Administer Sumatriptan 50mg IM in clinic.\n2. Prescribe Propranolol (20mg twice daily) for prophylactic treatment.\n3. Recommend neurological consultation within one month.\n\nDischarged stable. Follow-up appointment scheduled for 2024-09-25.", "output": "Medical"}
{"input": "Lecture Notes - Microeconomics\nTopic: Price Elasticity of Demand (PED)\n\nDefinition: Measures the responsiveness of quantity demanded to a change in price.\nFormula: PED = (% Change in Qd) / (% Change in P)\n\nTypes of Elasticity:\n1. Elastic (|PED| > 1): Quantity demanded changes significantly with price. (e.g., luxuries, goods with many substitutes).\n2. Inelastic (|PED| < 1): Quantity demanded changes little with price. (e.g., necessities, insulin, gasoline).\n3. Unit Elastic (|PED| = 1): Percentage change in quantity equals percentage change in price.\n\nKey Point: Total Revenue (TR = P * Q) relationship to PED. If demand is elastic, raising price decreases TR. If inelastic, raising price increases TR.", "output": "Economics"}
{"input": "Excerpt from Employment Contract\n\nEmployee: Rachel T. Vance\nPosition: Senior Analyst\nStart Date: 2024-11-01\n\nSalary and Compensation:\nAnnual Base Salary: INR 1,800,000, payable monthly.\nBonus: Eligible for an annual performance bonus up to 10% of base salary, discretionary.\n\nConfidentiality (Section 8):\nThe Employee agrees not to disclose, directly or indirectly, any proprietary information, trade secrets, or client lists acquired during employment. This obligation survives termination indefinitely.\n\nTermination Notice: Requires 30 days written notice from either party. The company reserves the right to place the employee on garden leave during the notice period.", "output": "Contracts"}
{"input": "Receipt\nVendor: Starbucks #501\nDate: 2024-09-08 09:15 AM\nOrder: 12\n\nItem Qty Price\nLatte (Large)\t1\t$5.50\nCroissant\t1\t$3.00\n\nSubtotal: $8.50\nTax: $0.68\nTotal: $9.18\n\nPayment Method: Mobile Pay. Transaction ID: A4492. Rewards balance updated. Have a great day!", "output": "Receipts"}
{"input": "Notes: Shakespeare - Hamlet Analysis\n\nTheme: Madness and Feigned Insanity\n\nKey Question: Is Hamlet truly mad or merely pretending to be mad to facilitate his revenge?\n\nEvidence for Feigned Madness:\n1. Soliloquies: His language remains coherent and highly intellectual when speaking to himself or Horatio.\n2. The Play-Within-A-Play: 'The Mousetrap' is a highly rational, calculated tactic designed to confirm Claudius's guilt.\n\nEvidence for Real Madness (or near-madness):\n1. Treatment of Ophelia: Cruelty seems excessive, perhaps driven by genuine emotional collapse.\n2. Rant in Gertrude's chamber (killing Polonius).\n\nKey Scene: Act III, Scene 1 ('To be or not to be'). His contemplation of suicide suggests deep psychological distress beyond mere pretense.", "output": "English"}
{"input": "Project Status Report - Core API V2 Migration\nReporting Date: 2024-09-15\nProject Manager: K. Lee\n\nOverall Health: Yellow (Dependencies)\n\nAchievements This Week:\n- Completed unit testing for user authentication module (95% coverage).\n- Deployed V2 to the staging environment for load testing.\n\nBlockers/Risks:\n- Waiting on Legal sign-off for the new terms of service before public API rollout. Legal review delayed by 5 days.\n- High latency detected in the database connection pool during peak load tests (avg 300ms, target <100ms). Investigation ongoing.\n\nNext Steps: Engineering team to prioritize database connection optimization (estimated 3 days work). PM to escalate Legal sign-off delay.", "output": "Projects"}
{"input": "Prescription\nPatient: Smith, Jennifer\nDOB: 1970-01-01\nDate: 2024-08-20\n\nRx:\nDrug: Atorvastatin (Lipitor)\nDosage: 20 mg\nQuantity: 90 tablets\nDirections: Take one tablet by mouth at bedtime.\nRefills: 6\n\nDiagnosis: Hypercholesterolemia (E78.0)\nPrescriber: Dr. T. Chen, Cardiology\nNote: Advise patient on diet and exercise modifications. Monitor liver function annually.", "output": "Prescriptions"}
{"input": "Annual Report Excerpt - Financial Risk Management\n\nSection 4.2: Liquidity Risk\n\nLiquidity risk is the risk that the company will encounter difficulty in meeting its financial obligations as they fall due. Our strategy relies on maintaining sufficient cash reserves and access to committed credit facilities.\n\nKey Metrics (as of 2024-06-30):\n- Current Ratio: 1.8:1 (Target: >1.5:1)\n- Quick Ratio: 1.1:1 (Target: >1.0:1)\n- Available Credit Line: $50 million (Unused)\n\nAssessment: The company's liquidity position remains strong and well above internal thresholds. No immediate liquidity concerns are identified. Sensitivity analysis suggests that a 20% drop in accounts receivable collection time could reduce the Current Ratio to 1.55:1, which is still manageable.", "output": "Finance"}
{"input": "Syllabus - Computer Science Fundamentals\nCourse: CS 101\nInstructor: Dr. A. Johnson\nSemester: Fall 2024\n\nTopics Covered:\nWeek 1-3: Introduction to algorithms, pseudo-code, basic data types.\nWeek 4-6: Control structures (If/Else, Loops), introduction to C++ syntax.\nWeek 7-9: Arrays, functions, and modular programming.\nWeek 10-12: Pointers and memory management.\n\nAssessment:\n- Quizzes (5): 20%\n- Programming Assignments (3): 40%\n- Final Exam: 40%\n\nRequired Software: Visual Studio Code and MinGW C++ compiler. Academic integrity is strictly enforced. Collaboration on assignments is permitted only for debugging.", "output": "Computer_Science"}
{"input": "Memo - Subject: Finalizing Patent Application Figures\n\nTo: R&D Team, Legal Counsel\nFrom: Patent Administration\nDate: 2024-09-02\n\nThe deadline for filing the non-provisional patent application for the 'Quantum Sensor' (Ref: QS-2024-449) is 2024-09-28.\n\nAction Required by R&D:\n1. Finalize technical drawings (Figures 1-8). Ensure drawings adhere to USPTO standards (no grayscale, clear margins, labeled references).\n2. Review the 'Background of the Invention' section for technical accuracy.\n\nAction Required by Legal:\n1. Confirm all claims are appropriately broad yet supported by the specification.\n2. Verify priority date claim based on provisional application P-2023-11.\n\nUrgent: Please schedule a final review meeting on 09/10 to ensure all elements are aligned before submission.", "output": "Legal"}
{"input": "Receipt - Grocery Store\n\nTRADER JOE'S #203\nDate: 09/07/2024 10:45 AM\n\nItem Qty Price\nMilk, Whole\t1\t$4.59\nEggs, Large\t2\t$3.99\t$7.98\nAvocados\t3\t$1.50\t$4.50\nCoffee Beans\t1\t$11.99\n\nSubtotal: $29.06\nTax: $0.00\nTotal: $29.06\n\nPayment: Debit Card XXXX-1010\nCashier: 4. Savings YTD: $12.50.", "output": "Receipts"}
{"input": "Notes on Financial Accounting\nTopic: Depreciation Methods\n\nDepreciation: Systematic allocation of the cost of a tangible asset over its useful life.\n\nMethods:\n1. Straight-Line Method: (Cost - Salvage Value) / Useful Life.\n   - Produces equal periodic expense.\n2. Double Declining Balance (DDB):\n   - Accelerated method. Depreciation Rate = 2 * (1 / Useful Life).\n   - Rate applied to the carrying value (book value).\n3. Units-of-Production:\n   - Depreciation based on actual usage/output.\n   - Rate = (Cost - Salvage Value) / Total Estimated Units.\n\nKey Concept: Assets must be impaired if the carrying amount exceeds the future undiscounted cash flows generated by the asset.", "output": "Accounts"}
{"input": "Assignment: Biology - Cell Division Report\nCourse: Bio 102\nDue Date: 2024-11-05\n\nTask: Compare and contrast Mitosis and Meiosis.\n\nRequirements:\n1. Detailed description of phases (Prophase, Metaphase, Anaphase, Telophase) for both processes.\n2. Explanation of genetic variation sources (crossing over, independent assortment) specifically in Meiosis.\n3. Identify the cell types and organisms that undergo each process.\n4. Include self-drawn diagrams for Metaphase I (Meiosis) and Metaphase (Mitosis). Label all chromosomes and spindles.\n\nFormat: 800-1000 words, scientific format (Introduction, Methods, Results, Discussion).", "output": "Assignments"}
{"input": "Travel Documents - Hotel Confirmation\nConfirmation Number: H-4492-ACME\nGuest: Mr. Alex J. Chen\nHotel: The Metropolitan\nCity: Chicago, IL\nCheck-in: 2024-11-01\nCheck-out: 2024-11-05\n\nRoom Type: King Deluxe\nRate: $320.00 per night (Corporate Rate)\nTotal Estimated Cost: $1,280.00\n\nGuarantee: Visa XXXX-9012. Includes breakfast buffet. Cancellation policy requires notice 48 hours prior to arrival. Directions to the conference center are attached in Appendix B.", "output": "Travel_Documents"}
{"input": "Code Comments - Java Utility Class\n\n```java\n/**\n * Utility class for common string manipulations used across the application.\n * Methods are static and designed to be thread-safe.\n */\npublic final class StringUtils {\n\n    private StringUtils() { /* Prevent instantiation */ }\n\n    /**\n     * Safely checks if a string is null or empty after trimming whitespace.\n     * @param str The input string.\n     * @return true if string is null, empty, or only whitespace.\n     */\n    public static boolean isBlank(String str) {\n        return str == null || str.trim().isEmpty();\n    }\n\n    /**\n     * Normalizes names by converting to Title Case.\n     * @param name The input name string (e.g., \"john doe\").\n     * @return The normalized string (e.g., \"John Doe\").\n     */\n    public static String toTitleCase(String name) {\n        // implementation uses Apache Commons StringUtils library\n        // ...\n    }\n}\n```", "output": "Computer_Science"}
{"input": "Minutes - Infrastructure Planning Meeting\nDate: 2024-09-04\nAttendees: M. Smith (Infra Lead), P. Vance (Network), K. Chen (Security)\n\nAgenda: Review of Q4 server maintenance schedule and cloud migration strategy.\n\nDecisions:\n1. Server Patching: Agreed to use the third Saturday of every month for non-critical patching, starting 2024-10-19.\n2. Cloud Strategy: Approved the 'Lift and Shift' approach for legacy applications (Phase I).\n3. Firewall Replacement: Confirmed budget approval for the new Palo Alto firewalls ($75,000 CapEx).\n\nAction Items:\n- P. Vance: Draft final implementation plan for the firewall swap. (Due 09/15)\n- K. Chen: Update security protocols to reflect multi-cloud environment access policies. (Due 09/30)", "output": "Meeting_Minutes"}
{"input": "WARRANTY INFORMATION\nProduct: Z-Flow Water Filtration System\nModel: ZFS-500\nPurchase Date: 2024-05-10\n\nCoverage: Z-Flow warrants this product against defects in materials and workmanship for a period of two (2) years from the original purchase date. Filters and consumable items are excluded.\n\nRemedy: Z-Flow will, at its option, repair or replace any defective parts free of charge. Customer is responsible for shipping costs to the service center.\n\nVoidance: Warranty is void if the product has been tampered with, subjected to improper maintenance, or used with non-Z-Flow branded replacement parts. Proof of purchase (receipt or invoice) is required for all claims.", "output": "Warranties"}
{"input": "Tax Filing Document - Schedule C (Profit or Loss from Business)\nTax Year: 2023\nTaxpayer: A. R. Miller\nBusiness: Freelance Web Development\n\nIncome:\nGross Receipts/Sales: $65,000\n\nExpenses:\nAdvertising: $500\nCar and Truck Expenses: $1,200\nOffice Expense (Supplies): $450\nContract Labor: $10,000\nDepreciation: $800\n\nTotal Expenses: $12,950\nNet Profit: $52,050\n\nNote: All mileage logs supporting car expenses are attached to the working papers. This form contributes to the overall individual tax liability (Form 1040).", "output": "Finance"}
{"input": "Lecture Notes - Electromagnetic Waves\nTopic: Polarization\n\nDefinition: Polarization refers to the direction of the electric field oscillation in a transverse electromagnetic wave.\n\nTypes:\n1. Linear Polarization: Oscillations occur along a single line (e.g., vertically or horizontally).\n2. Circular Polarization: The electric field rotates as the wave propagates.\n\nPolarizing Filters (Polaroids):\n- Only transmit light whose electric field vector is parallel to the transmission axis.\n- Malus' Law: I = I₀ cos²(θ)\n  - I: transmitted intensity\n  - I₀: incident intensity\n  - θ: angle between incident polarization and the filter axis.\n\nApplication: Used in LCD screens, sunglasses, and stress analysis in materials.", "output": "Physics"}
{"input": "Client Email - Subject: Proposal Feedback - System Integration\n\nHi Alex,\n\nWe reviewed the integration proposal (DS-2024-A) and generally approve the technical architecture outlined in Section 3 (using Kafka for message brokering). However, we have a major concern regarding the timeline.\n\nThe 12-week schedule for migrating 5 core legacy systems seems aggressive, especially considering the dependencies on our internal data cleansing team.\n\nRequest:\n1. Please provide a revised schedule showing a 16-week timeline, prioritizing the billing system migration first.\n2. Can you include a detailed cost breakdown for the proposed third-party security audit?\n\nWe are ready to move forward pending these minor revisions. Let me know when you can jump on a call. Thanks, Jane.", "output": "Client_Emails"}
{"input": "Lab Procedure - Gene Cloning Protocol\n\nPurpose: To insert the human insulin gene (Ins) into the pUC19 plasmid vector for expression in E. coli.\n\nSteps:\n1. Restriction Digestion: Digest both the Ins gene and pUC19 using EcoRI and HindIII restriction enzymes. Incubate at 37°C for 1 hour.\n2. Gel Electrophoresis: Run samples to confirm successful digestion and purify DNA fragments (Ins gene size: 1.5 kb; pUC19 size: 2.7 kb).\n3. Ligation: Mix purified Ins gene fragments and pUC19 vector DNA with T4 DNA Ligase. Incubate overnight at 16°C.\n4. Transformation: Transform ligated plasmid into competent E. coli cells (heat shock method).\n5. Selection: Plate bacteria on LB agar containing ampicillin and X-gal (blue/white screening).\n\nExpected Result: White colonies contain the recombinant plasmid.", "output": "Biology"}
{"input": "Receipt\nVendor: Shell Gas Station\nDate: 2024-09-02 14:00\nTransaction ID: 77890\n\nItem Qty Price\nRegular Unleaded\t18.5 gal\t$3.50/gal\t$64.75\nCoffee (Medium)\t1\t\t\t$2.50\n\nSubtotal: $67.25\nTax: $0.00\nTotal: $67.25\n\nPayment Method: Credit Card XXXX-1122. Approved. Thank you for filling up!", "output": "Receipts"}
{"input": "Assignment: Business Studies - Case Analysis\nCourse: BUS 201\nTopic: Analyze the competitive strategy of IKEA using Porter's Five Forces framework.\n\nRequirements:\n- Identify the primary source of competitive advantage (cost leadership or differentiation).\n- Analyze the bargaining power of suppliers and buyers in the furniture industry.\n- Assess the threat of new entrants and substitutes.\n- Conclusion must offer strategic recommendations for IKEA's expansion into developing markets.\n\nLength: 7-8 pages. Cite all sources using APA format. Due: 2024-11-28. Focus on applying the theory accurately.", "output": "Business_Studies"}
{"input": "Subject: System Maintenance Window - Q4 Database Migration\nFrom: IT Operations\nTo: All Employees\nDate: 2024-09-18\n\nDear Team,\n\nWe are scheduling a major database migration to enhance system stability and performance.\n\nActivity: Production Database Migration (Oracle to PostgreSQL)\nStart Time: Friday, October 18, 2024, 6:00 PM EST\nEnd Time: Sunday, October 20, 2024, 6:00 AM EST\n\nImpact: All internal applications relying on the primary database (ERP, CRM, Inventory) will be unavailable for the entire duration. This includes time tracking and expense reporting. Please plan accordingly.\n\nContingency: Dedicated hotlines (Ext. 4492) will be active throughout the maintenance window for critical issues. Thank you for your cooperation.", "output": "Official_Documents"}
{"input": "Curriculum Vitae Excerpt\nName: Dr. Anil S. Patel\n\n**Research Experience**\nPostdoctoral Fellow, Harvard Medical School (2020-2023)\n- Focused on structural analysis of novel antiviral agents using X-ray crystallography.\n- Published 3 first-author papers in *Nature* and *Science*.\n\n**Education**\nPh.D. Organic Chemistry, MIT (2020)\nB.S. Chemistry, University of Delhi (2015)\n\n**Skills**\nSpectroscopy (NMR, Mass Spec), Synthetic Organic Chemistry, High-Performance Computing (HPC). Fluent in Python and R for data analysis.", "output": "Certificates"}
