{
  "Physics": "Contains lecture notes, problem sets, and theoretical explanations for physics concepts. Covers mechanics, electromagnetism, thermodynamics, optics, and modern physics. Includes formulas, derivations, experimental results, and problem-solving methodologies relevant to the study of matter, energy, space, and time. Keywords: physics, mechanics, optics, electricity, magnetism, thermodynamics, quantum Keywords: physics, mechanics, optics, electricity, magnetism, thermodynamics, quantum",
  "Physics & Literature": "This folder contains documents that explore the intersection of scientific concepts, particularly physics and theoretical concepts like time travel, with literary works. It includes analyses of how scientific ideas are portrayed in fiction, comparisons between scientific theories and fictional narratives, and discussions on the broader implications of science in storytelling. Keywords: physics, literature, science fiction, time travel, relativity, wormholes, Kip Thorne Keywords: physics, literature, science fiction, time travel, relativity, wormholes, Kip Thorne",
  "Chemistry": "Practical records, lab reports, and handwritten notes about physical, organic, and inorganic chemistry. Includes titration, molarity, concentration, chemical equations, rate of reaction, qualitative analysis of salts, and experiments with acids, bases, or indicators. Keywords: titration, molarity, acid-base, kinetics, organic, inorganic Keywords: titration, molarity, acid-base, kinetics, organic, inorganic",
  "Programming": "Contains code snippets, programming exercises, and project outlines related to software development and data manipulation. Includes examples of algorithms, data structures, database queries, and DataFrame operations using various programming languages and libraries. Useful for learning and practicing coding skills. Keywords: programming, code, software, data, algorithm, DataFrame, query Keywords: programming, code, software, data, algorithm, DataFrame, query"
}