{
  "Academic Admissions": "This folder contains documents related to the admission process for academic institutions, including eligibility criteria, application guidelines, and regulatory standards. It covers requirements for various applicant types such as international students, those with foreign nationalities, and individuals holding equivalent educational qualifications. This resource supports understanding university entry requirements and academic regulations. Keywords: admissions, university, application, eligibility, regulations, academic, enrollment, criteria",
  "Chemistry": "Practical records, lab reports, and handwritten notes about physical, organic, and inorganic chemistry. Includes titration, molarity, concentration, chemical equations, rate of reaction, qualitative analysis of salts, and experiments with acids, bases, or indicators. Keywords: titration, chemical, acid-base, molarity, inorganic, organic, kinetics, compounds",
  "Physics": "Documents related to the study of matter, energy, and their interactions, covering mechanics, electromagnetism, thermodynamics, quantum physics, optics, and waves. Includes theories, experiments, formulas, problem-solving, and fundamental principles of the natural world. Keywords: thermodynamics, waves, physics, optics, electromagnetism, matter, mechanics, quantum, energy, forces",
  "Documents": "Various digital and physical files, records, and information. Includes general correspondence, miscellaneous notes, unclassified reports, forms, and other textual or media content awaiting specific categorization or review. Keywords: content, records, information, miscellaneous, forms, general, notes, unclassified, reports, files",
  "Computer Science": "This folder contains programming code, scripts, algorithms, data structures, and software development projects. It covers topics like Python, Pandas, data manipulation, databases, and computational logic. This resource supports learning and applying computer programming concepts. Keywords: computational logic, database, programming, pandas, sql, algorithms, python, software, computer science, data analysis, dataframe, data manipulation, development, databases, data structures, code",
  "Maths": "Mathematical problem sets, lecture notes, and textbooks. Covers topics such as algebra, calculus, geometry, statistics, and trigonometry. Includes equations, proofs, graphs, step-by-step solutions, and formulas for various mathematical problems. Keywords: differential equations, statistics, linear algebra, analysis, calculus, integrals, proofs, trigonometry, derivatives, functions, geometry, algebra, equations"
}