{
  "Physics": "Notes, experiments, and reports on mechanics, motion, light, reflection, refraction, lenses, mirrors, current, resistance, and magnetism. Includes derivations, numerical problems, formulas, lab observations, and project writeups on thermodynamics, electricity, and modern physics like relativity or quantum theory. Keywords: velocity, prism, ohm, current, resistance, focal length, refraction Keywords: velocity, prism, ohm, current, resistance, focal length, refraction",
  "Mathematics": "Problem sheets, class notes, and assignments on algebra, geometry, trigonometry, probability, and statistics. Includes derivations, formulas, step-by-step solutions, data analysis, and calculus topics like limits, differentiation, and integration. Keywords: calculus, differentiation, trigonometry, probability, matrix Keywords: calculus, differentiation, trigonometry, probability, matrix",
  "Informatic Practices": "Python and computer science practicals, code files, database projects, and IT reports. Includes Python scripts using pandas, numpy, or matplotlib, MySQL queries, CSV data handling, and DBMS exercises like CREATE TABLE or SELECT statements. Keywords: python, pandas, matplotlib, sql, database, csv Keywords: python, pandas, matplotlib, sql, database, csv",
  "Chemistry": "Practical records, lab reports, and handwritten notes about physical, organic, and inorganic chemistry. Includes titration, molarity, concentration, chemical equations, rate of reaction, qualitative analysis of salts, and experiments with acids, bases, or indicators. Keywords: titration, molarity, acid-base, kinetics, organic, inorganic Keywords: titration, molarity, acid-base, kinetics, organic, inorganic",
  "English": "Essays, articles, ASL scripts, literature analysis, and comprehension papers. Includes reports on poems, short stories, grammar exercises, and comparisons of literary or thematic ideas in texts. Also covers speeches, reviews, and listening/speaking assessments. Keywords: essay, poem, grammar, literature, asl, comprehension Keywords: essay, poem, grammar, literature, asl, comprehension",
  "Official Document": "Certificates, resumes, transcripts, and formal letters. Includes application forms, offer letters, recommendation letters, government or school-issued documents, and any paperwork used for verification or official purposes. Keywords: certificate, resume, transcript, letter, contract Keywords: certificate, resume, transcript, letter, contract",
  "Unsorted": "Files that don’t clearly fit into any subject or have mixed content. Used for random, miscellaneous, or unidentified documents waiting to be reviewed.  "
}