{
  "Physics": "Contains lecture notes, problem sets, and theoretical explanations for physics concepts. Covers mechanics, electromagnetism, thermodynamics, optics, and modern physics. Includes formulas, derivations, experimental results, and problem-solving methodologies relevant to the study of matter, energy, space, and time. Keywords: physics, mechanics, optics, electricity, magnetism, thermodynamics, quantum Keywords: physics, mechanics, optics, electricity, magnetism, thermodynamics, quantum",
  "Programming": "Contains code snippets, programming exercises, and project outlines related to software development and data manipulation. Includes examples of algorithms, data structures, database queries, and data frame operations. Focuses on practical application of programming languages and tools for problem-solving. Keywords: programming, code, algorithm, data frame, database, CSV, software Keywords: programming, code, algorithm, data frame, database, CSV, software",
  "Chemistry": "This folder contains laboratory reports, experimental procedures, and analysis of chemical compounds. It covers topics such as chromatography, titration, pH testing, and solubility, focusing on the properties and behaviors of substances like artificial sweeteners and their applications in beverages. Keywords: chemistry, artificial sweeteners, titration, chromatography, pH, solubility, chemical analysis Keywords: chemistry, artificial sweeteners, titration, chromatography, pH, solubility, chemical analysis",
  "Science & Literature": "This folder contains documents that explore the intersection of scientific concepts and literary works. It bridges the gap between scientific theories, such as time travel and physics, and their representation in fiction, including short stories, novels, and essays. The content may include analyses of scientific accuracy in literature, explorations of scientific themes in fiction, and discussions on how literature inspires scientific inquiry. Keywords: science, literature, physics, time travel, relativity, fiction, analysis Keywords: science, literature, physics, time travel, relativity, fiction, analysis"
}